In [1]:
# 참고 : 고수준? 사람에게 친숙한 자료구조라는 뜻, numpy 기반으로 개발됨

from pandas import Series, DataFrame
import pandas as pd
import numpy as np # numpy 기반이기 때문에 호출

In [5]:
# Series

In [6]:
data = Series([5,4,3,-1,9])

In [7]:
data

0    5
1    4
2    3
3   -1
4    9
dtype: int64

In [8]:
## values
data.values

array([ 5,  4,  3, -1,  9], dtype=int64)

In [9]:
## type
type(data.values)

numpy.ndarray

In [10]:
## index
data.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
## index 지정
data = [5,4,3,-1,9]
data2 = Series(data, index=['a','b','c','d','e'])

In [16]:
data2

a    5
b    4
c    3
d   -1
e    9
dtype: int64

In [18]:
data2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
## 값 불러오기
data2['a']

5

In [20]:
data2.c

3

In [23]:
## 여러 컬럼값 얻기 : [[]] 사용
data2[['a','b']]

a    5
b    4
dtype: int64

In [24]:
## numpy 내장함수 이용하기
np.sqrt(data2[['a','b']])

a    2.236068
b    2.000000
dtype: float64

In [25]:
np.sum(data2)

20

In [26]:
## sliceing
data2[data2>3]

a    5
b    4
e    9
dtype: int64

In [28]:
## 연산
data2 +10

a    15
b    14
c    13
d     9
e    19
dtype: int64

In [29]:
## for 문
for what in data2:
    print(what)  # dictionary for문은 key가 나오지만 여기는 value 값이 나온다

5
4
3
-1
9

In [31]:
## dictionary 를 Series 로 변환
product_and_price = {'choco_ball' : 2500, 'gum':700, 'bbabbaro' : 1700, 'sacomdalcom' : 500}

In [32]:
product_and_price

{'choco_ball': 2500, 'gum': 700, 'bbabbaro': 1700, 'sacomdalcom': 500}

In [36]:
product_series = Series(product_and_price, index=['choco_ball', 'gum', 'bbabbaro', 'sacomdalcom', 'potatto_chip']) 
## index 지정을 통하여 순서 지정 가능 (값이 없으면 NaN)
product_series

choco_ball      2500.0
gum              700.0
bbabbaro        1700.0
sacomdalcom      500.0
potatto_chip       NaN
dtype: float64

In [39]:
## Null 값 있는지 확인
product_series.isnull()

choco_ball      False
gum             False
bbabbaro        False
sacomdalcom     False
potatto_chip     True
dtype: bool

In [40]:
## Null 값 없는지 확인
product_series.notnull()

choco_ball       True
gum              True
bbabbaro         True
sacomdalcom      True
potatto_chip    False
dtype: bool

In [41]:
## null 인것들을 0 으로 세팅
product_series[product_series.isnull()] = 0

In [42]:
product_series

choco_ball      2500.0
gum              700.0
bbabbaro        1700.0
sacomdalcom      500.0
potatto_chip       0.0
dtype: float64

In [43]:
## name을 지정
product_series.name = 'price'

In [44]:
product_series

choco_ball      2500.0
gum              700.0
bbabbaro        1700.0
sacomdalcom      500.0
potatto_chip       0.0
Name: price, dtype: float64

In [46]:
## index name 을 지정
product_series.index.name = 'product name'

In [47]:
product_series

product name
choco_ball      2500.0
gum              700.0
bbabbaro        1700.0
sacomdalcom      500.0
potatto_chip       0.0
Name: price, dtype: float64

In [48]:
## 타입 변환 가능
product_series.astype(np.int)

product name
choco_ball      2500
gum              700
bbabbaro        1700
sacomdalcom      500
potatto_chip       0
Name: price, dtype: int32

In [51]:
## 인덱스의 순서 변경 (원본 변경이 아니라 바뀐것을 리턴)
product_series2 = product_series.reindex(['gum', 'choco_ball', 'sacomdalcom', 'potatto_chip', 'bbabbaro'])

In [52]:
product_series2

product name
gum              700.0
choco_ball      2500.0
sacomdalcom      500.0
potatto_chip       0.0
bbabbaro        1700.0
Name: price, dtype: float64

In [54]:
## 값 지우기
product_series3 = product_series2.drop('gum')

In [55]:
product_series3

product name
choco_ball      2500.0
sacomdalcom      500.0
potatto_chip       0.0
bbabbaro        1700.0
Name: price, dtype: float64

In [57]:
## slicing (일반 인덱싱과는 다르게 마지막을 포함해서 slice!!)
product_series3['sacomdalcom':'bbabbaro']

product name
sacomdalcom      500.0
potatto_chip       0.0
bbabbaro        1700.0
Name: price, dtype: float64

In [59]:
## slicing 및 할당
product_series3['sacomdalcom':'potatto_chip'] = 2000

In [60]:
product_series3

product name
choco_ball      2500.0
sacomdalcom     2000.0
potatto_chip    2000.0
bbabbaro        1700.0
Name: price, dtype: float64

In [61]:
# DataFrame : 2차원 (시리즈들의 모임)

In [63]:
data = {
    'name' : ['gum', 'choco_ball', 'potatto_chip', 'bbabbaro'],
    'price' : [1600,700,2500,200],
    'made' : ['a','a','b','c']
}

In [145]:
df = DataFrame(data, columns = ['name', 'price', 'made'], index=[1,2,3,4])
df

           name  price made
1           gum   1600    a
2    choco_ball    700    a
3  potatto_chip   2500    b
4      bbabbaro    200    c

In [146]:
# [] # 리턴이 시리즈
df['name']

1             gum
2      choco_ball
3    potatto_chip
4        bbabbaro
Name: name, dtype: object

In [147]:
# [[]] # 리턴이 데이터 프레임
df[['name']]

           name
1           gum
2    choco_ball
3  potatto_chip
4      bbabbaro

In [148]:
df.price

1    1600
2     700
3    2500
4     200
Name: price, dtype: int64

In [149]:
type(df.price) # 하나의 칼럼은 시리즈를 모아논 것

pandas.core.series.Series

In [150]:
# index(row) 로 데이터를 접근하는 경우
df.ix[1] # deprecated 되었다고 경고뜨지만 아직 OK (https://github.com/pandas-dev/pandas/issues/14218)

c:\users\kyung\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

  name  price made
1  gum   1600    a

In [151]:
df[df['price']>1000]

           name  price made
1           gum   1600    a
3  potatto_chip   2500    b

In [152]:
df[df['price']>1000].name

1             gum
3    potatto_chip
Name: name, dtype: object

In [153]:
# 칼럼 추가
df['amount'] = 100

In [154]:
df

           name  price made  amount
1           gum   1600    a     100
2    choco_ball    700    a     100
3  potatto_chip   2500    b     100
4      bbabbaro    200    c     100

In [155]:
# row 추가
df.ix[5] = ['sacomdalcom', 600, 'b', 100]

In [156]:
df

           name  price made  amount
1           gum   1600    a     100
2    choco_ball    700    a     100
3  potatto_chip   2500    b     100
4      bbabbaro    200    c     100
5   sacomdalcom    600    b     100

In [157]:
# transpose
df2 = df.T
df2

           1           2             3         4            5
name     gum  choco_ball  potatto_chip  bbabbaro  sacomdalcom
price   1600         700          2500       200          600
made       a           a             b         c            b
amount   100         100           100       100          100

In [158]:
# index 바꾸기
df3 = df.reindex([5,3,1,4,3])
df3

           name  price made  amount
5   sacomdalcom    600    b     100
3  potatto_chip   2500    b     100
1           gum   1600    a     100
4      bbabbaro    200    c     100
3  potatto_chip   2500    b     100

In [159]:
df3 = df3.reindex(columns=['price', 'name', 'amount', 'made'])
df3

   price          name  amount made
5    600   sacomdalcom     100    b
3   2500  potatto_chip     100    b
1   1600           gum     100    a
4    200      bbabbaro     100    c
3   2500  potatto_chip     100    b

In [160]:
# index 두개 : [[]] 사용 
df[['name','price']]

           name  price
1           gum   1600
2    choco_ball    700
3  potatto_chip   2500
4      bbabbaro    200
5   sacomdalcom    600

In [161]:
df.ix[[2,3], ['name', 'price']]

           name  price
2    choco_ball    700
3  potatto_chip   2500

In [162]:
df[df['price'] < 1000]

          name  price made  amount
2   choco_ball    700    a     100
4     bbabbaro    200    c     100
5  sacomdalcom    600    b     100

In [163]:
# slice
df[:3]

           name  price made  amount
1           gum   1600    a     100
2    choco_ball    700    a     100
3  potatto_chip   2500    b     100

In [164]:
# numpy 연산
np.sum(df.amount)

500

In [170]:
# 지우기
df = df.drop(2)

In [171]:
df

           name  price made  amount
1           gum   1600    a     100
3  potatto_chip   2500    b     100
4      bbabbaro    200    c     100
5   sacomdalcom    600    b     100

In [174]:
# column 지우기
df = df.drop('made', axis=1)

In [175]:
df

           name  price  amount
1           gum   1600     100
3  potatto_chip   2500     100
4      bbabbaro    200     100
5   sacomdalcom    600     100

In [176]:
# 표를 html로 변형
df.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>name</th>\n      <th>price</th>\n      <th>amount</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>1</th>\n      <td>gum</td>\n      <td>1600</td>\n      <td>100</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>potatto_chip</td>\n      <td>2500</td>\n      <td>100</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>bbabbaro</td>\n      <td>200</td>\n      <td>100</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>sacomdalcom</td>\n      <td>600</td>\n      <td>100</td>\n    </tr>\n  </tbody>\n</table>'